196. Delete Duplicate Emails

Table: Person

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| email       | varchar |
+-------------+---------+
id is the primary key (column with unique values) for this table.
Each row of this table contains an email. The emails will not contain uppercase letters.
 

Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.

For SQL users, please note that you are supposed to write a DELETE statement and not a SELECT one.

For Pandas users, please note that you are supposed to modify Person in place.

After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.

The result format is in the following example.

 

Example 1:

Input: 
Person table:
+----+------------------+
| id | email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
| 3  | john@example.com |
+----+------------------+
Output: 
+----+------------------+
| id | email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
+----+------------------+
Explanation: john@example.com is repeated two times. We keep the row with the smallest Id = 1.

There are two approaches to solve this problem: 1st wherein we modify the existing dataframe and 2nd where we create a new dataframe to store the desired results

### Approach 1: modify existing dataframe

In [18]:
import pandas as pd

data = {"id":[1,2,3],"email":["john@example.com","bob@example.com","john@example.com"]}

person = pd.DataFrame(data)

person

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [19]:
def delete_duplicate_emails(person: pd.DataFrame) -> None:
    person.sort_values("id",inplace=True)
    person.drop_duplicates("email", keep='first',inplace=True)

In [20]:
delete_duplicate_emails(person)

In [21]:
person

   id             email
0   1  john@example.com
1   2   bob@example.com

### Approach 2: return new dataframe, existing dataframe remains the same

In [22]:
data = {"id":[1,2,3],"email":["john@example.com","bob@example.com","john@example.com"]}

person = pd.DataFrame(data)

person

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [23]:
def delete_duplicate_emails(person: pd.DataFrame) -> None:
    person = person.sort_values("id")
    person = person.drop_duplicates("email", keep='first')
    return person

In [24]:
output = delete_duplicate_emails(person)

In [25]:
display(output)

   id             email
0   1  john@example.com
1   2   bob@example.com

In [26]:
display(person)

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

Person dataframe did not change outside the function

### SQL

DELETE FROM Person
WHERE id NOT IN (
    SELECT MIN(id)
    FROM Person
    GROUP BY email
);

-- Note: CTE is not supported with delete